doc/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Brian C. Wells' Homepage &#x2013; bcwells.net</title>
<!-- 2016-08-26 Fri 07:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Brian C. Wells" />
</head>
<body>
<div id="content">
<h1 class="title">Brian C. Wells' Homepage &#x2013; bcwells.net</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">News</a>
<ul>
<li><a href="#sec-1-1">August 26, 2016: Something Useful!</a></li>
</ul>
</li>
<li><a href="#sec-2">Software</a>
<ul>
<li><a href="#sec-2-1">org-tex-define</a></li>
</ul>
</li>
<li><a href="#sec-3">Articles</a>
<ul>
<li><a href="#sec-3-1">rotation</a></li>
</ul>
</li>
<li><a href="#sec-4">Contact</a></li>
</ul>
</div>
</div>
<dl class="org-dl">
<dt> Last Updated </dt><dd>August 26, 2016
</dd>
</dl>

<p>
Hi.  I am Brian C. Wells, and this is my personal website.  I intend
to publish software and articles about whatever interests me: mostly
computer science, mathematics, and economics/politics.
</p>

<p>
I am an Associate Member of the <a href="https://www.fsf.org/">Free Software Foundation</a>, which simply
means I donate $10/month to help them develop all their great
software.  I use 100% free software Operating Systems exclusively.  My
laptop computer runs <a href="https://trisquel.info/">Trisquel GNU/Linux</a> &#x2014; based on Ubuntu (and
therefore also Debian), but with <i>all non-free software removed</i>.  I
buy most of my hardware from <a href="https://www.thinkpenguin.com/">ThinkPenguin</a>, which allows me to run a
100% free OS like Trisquel without significant compatibility problems.
On my cell phone, I run <a href="http://www.replicant.us/">Replicant</a>, another fully free OS &#x2014; based on
Android, but again with all non-free software removed.  Recently, I
canceled my Netflix subscription because I am tired of financially
supporting a service that I can only actually use on some device that
I supposedly "own" and yet they have stolen my right to control.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">News</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">August 26, 2016: Something Useful!</h3>
<div class="outline-text-3" id="text-1-1">
<p>
I finally have something to put on this website which I think is
genuinely useful to someone besides me.  I used Emacs Org mode to
write an article on how to derive <a href="https://en.wikipedia.org/wiki/Rotation_matrix">rotation matrices</a> by purely
algebraic methods, and I wanted to publish it in both <a href="articles/rotation.html">HTML</a> and <a href="articles/rotation.pdf">PDF</a>
formats.  But since it uses a lot of mathematical notation, I ran into
a problem that both I and others have had with Org mode: the MathJax
library (for LaTeX math in HTML) and <i>real</i> LaTeX (for PDF) have
<i>slightly</i> different expectations for where and how LaTeX macros
should be defined, and <a href="http://stackoverflow.com/q/12717654">Org mode does not try to solve the problem</a>.
</p>

<p>
Several people have provided work-arounds for the problem, but so far
they all seem to require either
</p>

<ol class="org-ol">
<li>installing a large Emacs Lisp (<code>.el</code>) file somewhere, and still
quite clunky to use, such as manually updating a dynamic block; or
</li>
<li>using only a single very restricted method of defining macros,
namely <code>\global\def</code> inside <code>\(...\)</code> in an Org mode drawer.
</li>
</ol>

<p>
Inspired by <a href="https://github.com/fniessen/org-macros">another GitHub repository</a> to take advantage of Org mode's
(undocumented?) ability to evaluate Emacs Lisp code in its own native
macro definitions (at least in the version I tested with), I managed
to write an Org mode setup file which has neither of these problems.
The source code is available as an Org mode literate program in <a href="https://github.com/bcw/org-tex-define">this
GitHub repository</a>, the <a href="define.setup">unannotated setup file is here</a>, and <a href="#sec-3-1">rotation</a> is
the article I wrote it for.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Software</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">org-tex-define</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A simple literate program that uses an (apparently) undocumented
feature of Org mode to make <i>all</i> varieties of (La)TeX definitions
work in both HTML and PDF output.
</p>

<ul class="org-ul">
<li><a href="software/org-tex-define/define.html">HTML format</a>
</li>
<li><a href="software/org-tex-define/define.pdf">PDF format</a>
</li>
<li><a href="https://github.com/bcw/org-tex-define">Git source repository</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Articles</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">rotation</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A purely algebraic derivation of the 2-D <a href="https://en.wikipedia.org/wiki/Rotation_matrix">rotation matrix</a>.  First
article that uses <a href="#sec-2-1">org-tex-define</a>.
</p>

<ul class="org-ul">
<li><a href="articles/rotation.html">HTML format</a>
</li>
<li><a href="articles/rotation.pdf">PDF format</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Contact</h2>
<div class="outline-text-2" id="text-4">
<p>
You can send email to my first name (Brian) at this domain.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brian C. Wells</p>
<p class="date">Created: 2016-08-26 Fri 07:13</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
